RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_rcc.h
#define __HAL_RCC_RTC_DISABLE()        CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN)

/**
  * @}
  */

/** @brief  Macros to enable or disable the Internal High Speed 16MHz oscillator (HSI).
  * @note   The HSI is stopped by hardware when entering STOP and STANDBY modes.
  *         It is used (enabled by hardware) as system clock source after startup
  *         from Reset, wakeup from STOP and STANDBY mode, or in case of failure
  *         of the HSE used directly or indirectly as system clock (if the Clock
  *         Security System CSS is enabled).
  * @note   HSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the HSI.
  * @note   After enabling the HSI, the application software should wait on HSIRDY
  *         flag to be set indicating that HSI clock is stable and can be used as
  *         system clock source.
  *         This parameter can be: ENABLE or DISABLE.
  * @note   When the HSI is stopped, HSIRDY flag goes low after 6 HSI oscillator
  *         clock cycles.
  * @retval None
  */
#define __HAL_RCC_HSI_ENABLE()  SET_BIT(RCC->CR, RCC_CR_HSION)

#define __HAL_RCC_HSI_DISABLE() CLEAR_BIT(RCC->CR, RCC_CR_HSION)

/** @brief  Macro to adjust the Internal High Speed 16MHz oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICALIBRATIONVALUE__: specifies the calibration trimming value
  *         (default is RCC_HSICALIBRATION_DEFAULT).
  *         This parameter must be a number between 0 and 0x20.
  * @retval None
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICALIBRATIONVALUE__) \
  MODIFY_REG(RCC->ICSCR3, RCC_ICSCR3_HSITRIM, (uint32_t)(__HSICALIBRATIONVALUE__) << RCC_ICSCR3_HSITRIM_Pos)


/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (HSI)
  *           in STOP mode to be quickly available as kernel clock for USARTs, LPUART and I2Cs.
  * @note     Keeping the HSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSI startup time.
  * @note     The enable of this function has not effect on the HSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_HSISTOP_ENABLE()     SET_BIT(RCC->CR, RCC_CR_HSIKERON)

#define __HAL_RCC_HSISTOP_DISABLE()    CLEAR_BIT(RCC->CR, RCC_CR_HSIKERON)

/**
  * @brief    Macros to enable or disable the force of the Internal Multi Speed kernel oscillator (MSIK)
  *           in STOP mode to be quickly available as kernel clock for USARTs, LPUART and I2Cs.
  * @note     Keeping the MSIK ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the MSIK startup time.
  * @note     The enable of this function has not effect on the MSIKON bit.
  * @note     The MSIKERON must be configured at 0 before entreing stop 3 mode.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_MSIKSTOP_ENABLE()     SET_BIT(RCC->CR, RCC_CR_MSIKERON)

#define __HAL_RCC_MSIKSTOP_DISABLE()    CLEAR_BIT(RCC->CR, RCC_CR_MSIKERON)

/**
  * @brief  Macros to enable or disable the Internal Multi Speed oscillator (MSI).
  * @note     The MSI is stopped by hardware when entering STOP and STANDBY modes.
  *           It is used (enabled by hardware) as system clock source after
  *           startup from Reset, wakeup from STOP and STANDBY mode, or in case
  *           of failure of the HSE used directly or indirectly as system clock
  *           (if the Clock Security System CSS is enabled).
  * @note     MSI can not be stopped if it is used as system clock source.
  *           In this case, you have to select another source of the system
  *           clock then stop the MSI.
  * @note     After enabling the MSI, the application software should wait on
  *           MSIRDY flag to be set indicating that MSI clock is stable and can
  *           be used as system clock source.
  * @note   When the MSI is stopped, MSIRDY flag goes low after 6 MSI oscillator
  *         clock cycles.
  * @retval None
  */
#define __HAL_RCC_MSI_ENABLE()  SET_BIT(RCC->CR, RCC_CR_MSISON)

#define __HAL_RCC_MSI_DISABLE() CLEAR_BIT(RCC->CR, RCC_CR_MSISON)

/**
  * @brief  Macro configures the Internal Multi Speed oscillator (MSI) clock range in run mode
  * @note     After restart from Reset , the MSI clock is around 4 MHz.
  *           After stop the startup clock can be MSI (at any of its possible
  *           frequencies, the one that was used before entering stop mode) or HSI.
  *          After Standby its frequency can be selected between 4 possible values
  *          (1, 3.072, 4 or 8 MHz).
  * @note     MSIRANGE can be modified when MSI is OFF (MSION=0) or when MSI is ready
  *          (MSIRDY=1).
  * @note    The MSI clock range after reset can be modified on the fly.
  * @param  __MSIRANGEVALUE__: specifies the MSI clock range.
  *         This parameter must be one of the following values:
  *            @arg @ref RCC_MSIRANGE_0  MSI clock is around 48 MHz
  *            @arg @ref RCC_MSIRANGE_1  MSI clock is around 24 KHz
  *            @arg @ref RCC_MSIRANGE_2  MSI clock is around 16 MHz
  *            @arg @ref RCC_MSIRANGE_3  MSI clock is around 12 MHz
  *            @arg @ref RCC_MSIRANGE_4  MSI clock is around 4 MHz (default after Reset)
  *            @arg @ref RCC_MSIRANGE_5  MSI clock is around 2 MHz
  *            @arg @ref RCC_MSIRANGE_6  MSI clock is around 1.33 MHz
  *            @arg @ref RCC_MSIRANGE_7  MSI clock is around 1 MHz
  *            @arg @ref RCC_MSIRANGE_8  MSI clock is around 3.072 MHz
  *            @arg @ref RCC_MSIRANGE_9  MSI clock is around 1.536 MHz
  *            @arg @ref RCC_MSIRANGE_10 MSI clock is around 1.024 MHz
  *            @arg @ref RCC_MSIRANGE_11 MSI clock is around 768 KHz
  *            @arg @ref RCC_MSIRANGE_12 MSI clock is around 400 KHz
  *            @arg @ref RCC_MSIRANGE_13 MSI clock is around 200 KHz
  *            @arg @ref RCC_MSIRANGE_14 MSI clock is around 133 KHz
  *            @arg @ref RCC_MSIRANGE_15 MSI clock is around 100 KHz
  * @retval None
  */
#define __HAL_RCC_MSI_RANGE_CONFIG(__MSIRANGEVALUE__) \
  do {                                                         \
    SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL);                         \
    MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSISRANGE, (__MSIRANGEVALUE__)); \
  } while(0)
/**
  * @brief  Macro configures the Internal Multi Speed kernel oscillator (MSIK) clock range in run mode
  * @note     After restart from Reset , the MSIK clock is around 4 MHz.
  *           After stop the startup clock can be MSIK (at any of its possible
  *           frequencies, the one that was used before entering stop mode) or HSI.
  *          After Standby its frequency can be selected between 4 possible values
  *          (1, 3.072, 4 or 8 MHz).
  * @note     MSIKRANGE can be modified when MSIK is OFF (MSIKON=0) or when MSIK is ready
  *          (MSIKRDY=1).
  * @note    The MSI clock range after reset can be modified on the fly.
  * @param  __MSIKRANGEVALUE__: specifies the MSI clock range.
  *            @arg @ref RCC_MSIKRANGE_0  MSIK clock is around 48 MHz
  *            @arg @ref RCC_MSIKRANGE_1  MSIK clock is around 24 KHz
  *            @arg @ref RCC_MSIKRANGE_2  MSIK clock is around 16 MHz
  *            @arg @ref RCC_MSIKRANGE_3  MSIK clock is around 12 MHz
  *            @arg @ref RCC_MSIKRANGE_4  MSIK clock is around 4 MHz (default after Reset)
  *            @arg @ref RCC_MSIKRANGE_5  MSIK clock is around 2 MHz
  *            @arg @ref RCC_MSIKRANGE_6  MSIK clock is around 1.33 MHz
  *            @arg @ref RCC_MSIKRANGE_7  MSIK clock is around 1 MHz
  *            @arg @ref RCC_MSIKRANGE_8  MSIK clock is around 3.072 MHz
  *            @arg @ref RCC_MSIKRANGE_9  MSIK clock is around 1.536 MHz
  *            @arg @ref RCC_MSIKRANGE_10 MSIK clock is around 1.024 MHz
  *            @arg @ref RCC_MSIKRANGE_11 MSIK clock is around 768 KHz
  *            @arg @ref RCC_MSIKRANGE_12 MSIK clock is around 400 KHz
  *            @arg @ref RCC_MSIKRANGE_13 MSIK clock is around 200 KHz
  *            @arg @ref RCC_MSIKRANGE_14 MSIK clock is around 133 KHz
  *            @arg @ref RCC_MSIKRANGE_15 MSIK clock is around 100 KHz
  * @retval None
  */
#define __HAL_RCC_MSIK_RANGE_CONFIG(__MSIKRANGEVALUE__) \
  do {                                                         \
    SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL);                         \
    MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIKRANGE, (__MSIKRANGEVALUE__)); \
  } while(0)

/** @brief  Macros to enable or disable the MSI bias mode selection.
  * @note   By default the MSI bias is in continuous mode in order to maintain
  *         the output clocks accuracy.
  * @note   Setting this bit reduces the MSI consumption under range 4 but decrease its accuracy.
  * @retval None
  */
#define __HAL_RCC_MSIBIAS_SELECTION_ENABLE()         SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIBIAS)

#define __HAL_RCC_MSIBIAS_SELECTION_DISABLE()        CLEAR_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIBIAS)

/** @brief  Macros to enable or disable LSE clock glitch filter .
  * @note   The glitches on LSE can be filtred by setting the LSEGFON.
  * @note   LSEGFON must be written when the LSE is disabled (LSEON = 0 and LSERDY = 0).
  * @retval None
  */

#define __HAL_RCC_LSE_GLITCHFILTER_ENABLE()           SET_BIT(RCC->BDCR, RCC_BDCR_LSEGFON )

#define __HAL_RCC_LSE_GLITCHFILTER_DISABLE()          CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEGFON )
/**
  * @brief  Macro configures the Internal Multi Speed oscillator (MSI) clock range after Standby mode
  *         After Standby its frequency can be selected between 5 possible values (4, 2, 1.5, 1, or 3.072 MHz).
  * @param  __MSIRANGEVALUE__: specifies the MSI clock range.
  *         This parameter must be one of the following values:
  *            @arg @ref RCC_MSIRANGE_4  MSI clock is around 4 MHz (default after Reset)
  *            @arg @ref RCC_MSIRANGE_5  MSI clock is around 2 MHz
  *            @arg @ref RCC_MSIRANGE_6  MSI clock is around 1.5 MHz
  *            @arg @ref RCC_MSIRANGE_7  MSI clock is around 1 MHz
  *            @arg @ref RCC_MSIRANGE_8  MSI clock is around 3.072 MHz
  * @retval None
  */
#define __HAL_RCC_MSI_STANDBY_RANGE_CONFIG(__MSIRANGEVALUE__) do {SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL);\
                                                                   MODIFY_REG(RCC->CSR, RCC_CSR_MSISSRANGE,\
                                                                   (__MSIRANGEVALUE__) >> (RCC_ICSCR1_MSISRANGE_Pos -\
                                                                   RCC_CSR_MSISSRANGE_Pos));\
                                                                 } while(0)
/**
  * @brief  Macro configures the Internal Multi Speed oscillator (MSIK) clock range after Standby mode
  *         After Standby its frequency can be selected between 5 possible values (4, 2, 1.5, 1, or 3.072 MHz).
  * @param  __MSIRANGEVALUE__: specifies the MSI clock range.
  *         This parameter must be one of the following values:
  *            @arg @ref RCC_MSIRANGE_4  MSI clock is around 4 MHz (default after Reset)
  *            @arg @ref RCC_MSIRANGE_5  MSI clock is around 2 MHz
  *            @arg @ref RCC_MSIRANGE_6  MSI clock is around 1.5 MHz
  *            @arg @ref RCC_MSIRANGE_7  MSI clock is around 1 MHz
  *            @arg @ref RCC_MSIRANGE_8  MSI clock is around 3.072 MHz
  * @retval None
  */
#define __HAL_RCC_MSIK_STANDBY_RANGE_CONFIG(__MSIRANGEVALUE__) do {SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL); \
                                                                    MODIFY_REG(RCC->CSR, RCC_CSR_MSISSRANGE,\
                                                                    (__MSIRANGEVALUE__) >> (RCC_ICSCR1_MSISRANGE_Pos -\
                                                                    RCC_CSR_MSISSRANGE_Pos));\
                                                                   } while(0)

/** @brief  Macro to get the Internal Multi Speed oscillator (MSI) clock range in run mode
  * @retval MSI clock range.
  *         This parameter must be one of the following values:
  *            @arg @ref RCC_MSIRANGE_0  MSI clock is around 48 MHz
  *            @arg @ref RCC_MSIRANGE_1  MSI clock is around 24 KHz
  *            @arg @ref RCC_MSIRANGE_2  MSI clock is around 16 MHz
  *            @arg @ref RCC_MSIRANGE_3  MSI clock is around 12 MHz
  *            @arg @ref RCC_MSIRANGE_4  MSI clock is around 4 MHz
  *            @arg @ref RCC_MSIRANGE_5  MSI clock is around 2 MHz
  *            @arg @ref RCC_MSIRANGE_6  MSI clock is around 1.33 MHz
  *            @arg @ref RCC_MSIRANGE_7  MSI clock is around 1 MHz
  *            @arg @ref RCC_MSIRANGE_8  MSI clock is around 3.072 MHz
  *            @arg @ref RCC_MSIRANGE_9  MSI clock is around 1.536 MHz
  *            @arg @ref RCC_MSIRANGE_10 MSI clock is around 1.024 MHz
  *            @arg @ref RCC_MSIRANGE_11 MSI clock is around 768 KHz
  *            @arg @ref RCC_MSIRANGE_12 MSI clock is around 400 KHz
  *            @arg @ref RCC_MSIRANGE_13 MSI clock is around 200 KHz
  *            @arg @ref RCC_MSIRANGE_14 MSI clock is around 133 KHz
  *            @arg @ref RCC_MSIRANGE_15 MSI clock is around 100 KHz
  */
#define __HAL_RCC_GET_MSI_RANGE()       ((READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL) != 0U) ?             \
                                         (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSISRANGE)) :            \
                                         (uint32_t)(READ_BIT(RCC->CSR, RCC_CSR_MSISSRANGE) << \
                                                    (RCC_ICSCR1_MSISRANGE_Pos - RCC_CSR_MSISSRANGE_Pos)))

